exports.fullContact = `
КОНТРАКТ#
_слово1: $слово {A1};
_слово2: $слово {A1};
_слово3: $слово {A1};
_упаковка: $время {УП};
_получениеСлов: $время {^АВТОР(_упаковка)};
_получилПродукт: $время {B3};
ДАННЫЕ#
_себестоимостьСлов: ^ВЕС(_слово1)+^ВЕС(_слово2)+^ВЕС(_слово3);
_времяУпаковки: _упаковка - _получениеСлов;
РЕЗУЛЬТАТ#
A1: ^УСЛ(_ВРЕМЯ - _получилПродукт > 300 ?  _себестоимостьСлов*2 , ^УСЛ(_себестоимостьСлов > 120 ) ?  _себестоимостьСлов , 0);
^АВТОР(_упаковка): ^УСЛ( _времяУпаковки < 60 ? _себестоимостьСлов*0.1 , ^УСЛ(_времяУпаковки < 120 ? 5 : 1) );`;
exports.contacrtErr1 = `
КОРАКТ#
_слово1: $слово {A1};
_слово2: $слово {A1};
_слово3: $слово {А1};
_упаковка: $время {УП};
_получениеСлов: $время {^АВТОР(_упаковка)};
_получилПродукт: $время {B3};
ДАННЫЕ#
_себестоимостьСлов: ^ВЕС(_слово1)+^ВЕС(_слово2)+^ВЕС(_слово3);
_времяУпаковки: _упаковка - _получениеСлов;
РЕЗУЛЬТАТ#
A1: ^УСЛ(_ВРЕМЯ - _получилПродукт > 300 ?  _себестоимостьСлов*2 , ^УСЛ(_себестоимостьСлов > 120 ) ?  _себестоимостьСлов , 0);
^АВТОР(_упаковка): ^УСЛ( _времяУпаковки < 60 ? _себестоимостьСлов*0.1 , ^УСЛ(_времяУпаковки < 120 ? 5 , 1) );`;
exports.contacrtErr2 = `
23
123КОНТРАКТ#
_слово1: $слово {A1};
_слово2: $слово {A1};
_слово3: $слово {А1};
_упаковка: $время {УП};
_получениеСлов: $время {^АВТОР(_упаковка)};
_получилПродукт: $время {B3};
РЕЗУЛЬТАТ#
A1: ^УСЛ(_ВРЕМЯ - _получилПродукт > 300 ?  _себестоимостьСлов*2 , ^УСЛ(_себестоимостьСлов > 120 ) ?  _себестоимостьСлов , 0);
^АВТОР(_упаковка): ^УСЛ( _времяУпаковки < 60 ? _себестоимостьСлов*0.1 , ^УСЛ(_времяУпаковки < 120 ? 5 : 1) );`;
exports.contacrtErr3 = `
КОНТРАКТ#
_слово1: $слово {A1};
_слово2: $слово {A1};
_слово3: $слово {А1};
_упаковка: $время {УП};
_получениеСлов: $время {^АВТОР(_упаковка)};
_получилПродукт: $время {B3};
ДАННЫЕ#
_себестоимостьСлов: ^ВЕС(_слово1)+^ВЕС(_слово2)+^ВЕС(_слово3);
_времяУпаковки: _упаковка - _получениеСлов;
РЕЗУЛЬТА
A1: ^УСЛ(_ВРЕМЯ - _получилПродукт > 300 ?  _себестоимостьСлов*2 , ^УСЛ(_себестоимостьСлов > 120 ) ?  _себестоимостьСлов , 0);
^АВТОР(_упаковка): ^УСЛ( _времяУпаковки < 60 ? _себестоимостьСлов*0.1 , ^УСЛ(_времяУпаковки < 120 ? 5 : 1) );`;
exports.fullFields = [ '_слово1:$слово{A1}',
'_слово2:$слово{A1}',
'_слово3:$слово{А1}',
'_упаковка:$время{УП}',
'_получениеСлов:$время{^АВТОР(_упаковка)}',
'_получилПродукт:$время{B3}' ];
exports.errFields = [
'_слово2:$славо{A1}',
'_слово3:$слово{А11}',
'_english:$время{УП}',
'_получениеСлов:$время{^АВТОР(_упаковка)}',
'_получилПродукт:$время{B3}' ];
exports.resultTest = `^УСЛ(((_ВРЕМЯ - _получилПродукт) >= 300) ?  ((_себестоимостьСлов*2)*3) , ^УСЛ((_себестоимостьСлов > 120 ) ?  _себестоимостьСлов , 0))`;
exports.stackTrace = {
    type: 'cond',
    method: '>=',
    args: [
        {
            type: 'method',
            method: '-',
            args: [
                {type: 'field', value: '_ВРЕМЯ'},
                {type: 'field', value: '_получилПродукт'}
            ]
        },
        {type: 'number', value: 300}
    ],
    onTrue: {
        type: 'method',
        method: '*',
        args: [
            {type: 'number', value: 3},
            {type: 'method', method: '*', args: [
                {type: 'number', value: 2},
                {type: 'field', value: '_себестоимостьСлов'}
            ]}
        ]
    },
    onFalse: {
        type: 'cond',
        method: '>',
        args: [
            {type: 'field', value: '_себестоимостьСлов'},
            {type: 'number', value: 120},
        ],
        onTrue: {
            type: 'field', value: '_себестоимостьСлов'
        },
        onFalse: {
            type: 'number', value: 0
        }
    }
};
exports.liteFullTest = `
КОНТРАКТ#
_слово1: $слово {A1};
_слово2: $слово {A1};
_время1: $время {B1};
РЕЗУЛЬТАТ#
B1: ^УСЛ(_время1>10?^УСЛ(0>2?(^УСЛ(3==0?5|(^ВЕС(_слово1)*1.5))|1)|(^ВЕС(_слово2)*2));
^АВТОР(_слово2): ^УСЛ(^ВЕС(_слово1)>^ВЕС(_слово2)?(^ВЕС(_слово1)+^ВЕС(_слово2))|(^ВЕС(_слово2)+3));
`;

exports.resultTest2 = `^УСЛ((_ВРЕМЯ - _получилПродукт) >= 300 ?  ^УСЛ( 0@@_себестоимостьСлов ? (_себестоимостьСлов*2)*3 | 1) | ^УСЛ(_себестоимостьСлов > 120  ?  _себестоимостьСлов | 0))`;
